In [1]:
import pandas as pd

In [3]:
s = pd.Series([3,5,9,7,4])
s

0    3
1    5
2    9
3    7
4    4
dtype: int64

In [4]:
s.head() # gives top five rows

0    3
1    5
2    9
3    7
4    4
dtype: int64

# importing data from url

In [5]:
ufo = pd.read_table('http://bit.ly/uforeports',sep = ',')

In [9]:
ufo.head() # first five rows

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [10]:
ufo['State']

0        NY
1        NJ
2        CO
3        KS
4        NY
5        ND
6        CA
7        MI
8        AK
9        OR
10       CA
11       AL
12       SC
13       IA
14       MI
15       CA
16       CA
17       GA
18       TN
19       AK
20       NE
21       LA
22       LA
23       KY
24       WV
25       CA
26       WV
27       NM
28       NM
29       UT
         ..
18211    MA
18212    CA
18213    CA
18214    TX
18215    TX
18216    CA
18217    CO
18218    TX
18219    CA
18220    CA
18221    NH
18222    PA
18223    SC
18224    OK
18225    CA
18226    CA
18227    CA
18228    TX
18229    IL
18230    CA
18231    CA
18232    WI
18233    AK
18234    CA
18235    AZ
18236    IL
18237    IA
18238    WI
18239    WI
18240    FL
Name: State, Length: 18241, dtype: object

In [13]:
ufo['Location'] = ufo.City + ','+ ufo.State
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca,NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro,NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke,CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene,KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair,NY"

In [14]:
ufo.shape

(18241, 6)

In [15]:
ufo.dtypes # data types

City               object
Colors Reported    object
Shape Reported     object
State              object
Time               object
Location           object
dtype: object

In [16]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time',
       'Location'],
      dtype='object')

# Removing columns

In [21]:
ufo = pd.read_table('http://bit.ly/uforeports',sep = ',')
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [32]:
ufo.drop(['Time'], axis =1, inplace = True) #axis = 0 for row and 1 for columns
ufo.head()

                   City Shape Reported
0                Ithaca       TRIANGLE
1           Willingboro          OTHER
2               Holyoke           OVAL
3               Abilene           DISK
4  New York Worlds Fair          LIGHT

# Sorting

In [36]:
ufo.City.sort_values(ascending = True).head(5)

1761     Abbeville
4553      Aberdeen
16167     Aberdeen
14703     Aberdeen
389       Aberdeen
Name: City, dtype: object

In [38]:
ufo.sort_values(['City', 'Shape Reported']).head(5)

            City Shape Reported
1761   Abbeville           DISK
389     Aberdeen         CIRCLE
4553    Aberdeen       CYLINDER
9404    Aberdeen           DISK
12294   Aberdeen       FIREBALL